CALC010:CMD PROMPT('Calculate Total')

   PARM KWD(NUM1) TYPE(*DEC) LEN(5 0) PROMPT('First Number')

   PARM KWD(NUM2) TYPE(*DEC) LEN(5 0) PROMPT('Second Number')

   PARM KWD(TOTAL) TYPE(*DEC) LEN(10 0) PROMPT('Total') DFT(0)
